; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v6)
             (pred_9 ?v7 ?v13)
             (pred_2 ?v10 ?v13)
             (pred_1 ?v5 ?v10 )
	     (pred_6 ?v10)
             (pred_12 ?v4)
             (pred_11 ?v7)
             (pred_3 ?v13)
             (pred_7 ?v10)
             (pred_5 ?v7)
             (pred_4 ?v10)
             (pred_8 ))



(:action op_2
:parameters (?v11 ?v2 ?v1 ?v9)
:precondition (and (pred_12 ?v11) (pred_12 ?v2) (pred_11 ?v1) (pred_3 ?v9)
          (pred_10 ?v11 ?v2) (pred_9 ?v1 ?v9)
                   (pred_2 ?v2 ?v9) (pred_6 ?v11) 
                   (pred_7 ?v2) (pred_5 ?v1))
:effect (and  (pred_4 ?v2) (not (pred_7 ?v2))))


(:action op_3
:parameters (?v11 ?v8)
:precondition (and (pred_12 ?v11) (pred_12 ?v8)
               (pred_6 ?v11) (pred_10 ?v11 ?v8) (pred_4 ?v8))
:effect (and (pred_6 ?v8) (not (pred_6 ?v11))))

(:action op_4
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_11 ?v1) 
                  (pred_6 ?v11) (pred_1 ?v1 ?v11) (pred_8 ))
:effect (and (pred_5 ?v1)
   (not (pred_1 ?v1 ?v11)) (not (pred_8 ))))


(:action op_5
:parameters (?v11 ?v3 ?v12)
:precondition (and (pred_12 ?v11) (pred_11 ?v3) (pred_11 ?v12)
                  (pred_6 ?v11) (pred_5 ?v12) (pred_1 ?v3 ?v11))
:effect (and (pred_5 ?v3) (pred_1 ?v12 ?v11)
        (not (pred_5 ?v12)) (not (pred_1 ?v3 ?v11))))

(:action op_1
:parameters (?v11 ?v1)
:precondition (and (pred_12 ?v11) (pred_11 ?v1) 
                  (pred_6 ?v11) (pred_5 ?v1))
:effect (and (pred_8 ) (pred_1 ?v1 ?v11) (not (pred_5 ?v1)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_31 obj_02 obj_16 obj_20 obj_24 obj_17 obj_14 obj_30 obj_08 obj_28 obj_15 obj_29 obj_18 obj_27 obj_06 obj_13 obj_10 obj_03 obj_19 obj_11 obj_26 obj_09 obj_04 obj_22
    obj_05 obj_25 obj_21
    obj_07 obj_23 obj_01
    )

    (:init
       (pred_8)

       (pred_12 obj_12)
       (pred_12 obj_31)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_20)
       (pred_12 obj_24)
       (pred_12 obj_17)
       (pred_12 obj_14)
       (pred_12 obj_30)
       (pred_12 obj_08)
       (pred_12 obj_28)
       (pred_12 obj_15)
       (pred_12 obj_29)
       (pred_12 obj_18)
       (pred_12 obj_27)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_12 obj_10)
       (pred_12 obj_03)
       (pred_12 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_26)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_22)
       (pred_3 obj_05)
       (pred_3 obj_25)
       (pred_3 obj_21)
       (pred_11 obj_07)
       (pred_11 obj_23)
       (pred_11 obj_01)

       (pred_10 obj_12 obj_24)
       (pred_10 obj_12 obj_31)
       (pred_10 obj_31 obj_17)
       (pred_10 obj_31 obj_02)
       (pred_10 obj_31 obj_12)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_31)
       (pred_10 obj_16 obj_30)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_24 obj_28)
       (pred_10 obj_24 obj_17)
       (pred_10 obj_24 obj_12)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_31)
       (pred_10 obj_17 obj_24)
       (pred_10 obj_14 obj_29)
       (pred_10 obj_14 obj_30)
       (pred_10 obj_14 obj_02)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_30 obj_18)
       (pred_10 obj_30 obj_08)
       (pred_10 obj_30 obj_16)
       (pred_10 obj_30 obj_14)
       (pred_10 obj_08 obj_27)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_30)
       (pred_10 obj_28 obj_06)
       (pred_10 obj_28 obj_15)
       (pred_10 obj_28 obj_24)
       (pred_10 obj_15 obj_13)
       (pred_10 obj_15 obj_29)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_15 obj_28)
       (pred_10 obj_29 obj_10)
       (pred_10 obj_29 obj_18)
       (pred_10 obj_29 obj_14)
       (pred_10 obj_29 obj_15)
       (pred_10 obj_18 obj_03)
       (pred_10 obj_18 obj_27)
       (pred_10 obj_18 obj_30)
       (pred_10 obj_18 obj_29)
       (pred_10 obj_27 obj_19)
       (pred_10 obj_27 obj_08)
       (pred_10 obj_27 obj_18)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_28)
       (pred_10 obj_13 obj_26)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_15)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_29)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_03 obj_04)
       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_19 obj_22)
       (pred_10 obj_19 obj_27)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_11 obj_26)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_26 obj_09)
       (pred_10 obj_26 obj_13)
       (pred_10 obj_26 obj_11)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_26)
       (pred_10 obj_04 obj_22)
       (pred_10 obj_04 obj_03)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_22 obj_19)
       (pred_10 obj_22 obj_04)
       (pred_7 obj_18)
       (pred_7 obj_26)
       (pred_7 obj_04)
       (pred_2  obj_18 obj_05)
       (pred_2  obj_26 obj_25)
       (pred_2  obj_04 obj_21)
       (pred_4 obj_12)
       (pred_4 obj_31)
       (pred_4 obj_02)
       (pred_4 obj_16)
       (pred_4 obj_20)
       (pred_4 obj_24)
       (pred_4 obj_17)
       (pred_4 obj_14)
       (pred_4 obj_30)
       (pred_4 obj_08)
       (pred_4 obj_28)
       (pred_4 obj_15)
       (pred_4 obj_29)
       (pred_4 obj_27)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_10)
       (pred_4 obj_03)
       (pred_4 obj_19)
       (pred_4 obj_11)
       (pred_4 obj_09)
       (pred_4 obj_22)

       (pred_9  obj_07 obj_05)
       (pred_9  obj_23 obj_25)
       (pred_9  obj_01 obj_21)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_23 obj_19)
       (pred_1 obj_01 obj_20)
       (pred_6 obj_14)
    )

    (:goal (and
       (pred_1 obj_07 obj_29)
       (pred_1 obj_23 obj_03)
    ))
(:constraints
  (always (not (pred_6 obj_10)))
)
)

; plan
1. (op_3 obj_14 obj_29)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_29)
   goals met: 0 of 2
2. (op_3 obj_29 obj_15)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_15)
   goals met: 0 of 2
3. (op_4 obj_15 obj_07)
   deleted: (pred_1 obj_07 obj_15) (pred_8)
   added: (pred_5 obj_07)
   goals met: 0 of 2
4. (op_3 obj_15 obj_29)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_29)
   goals met: 0 of 2
5. (op_2 obj_29 obj_18 obj_07 obj_05)
   deleted: (pred_7 obj_18)
   added: (pred_4 obj_18)
   goals met: 0 of 2
6. (op_1 obj_29 obj_07)
   deleted: (pred_5 obj_07)
   added: (pred_8) (pred_1 obj_07 obj_29)
   goals met: 1 of 2
7. (op_3 obj_29 obj_18)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_18)
   goals met: 1 of 2
8. (op_3 obj_18 obj_03)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_03)
   goals met: 1 of 2
9. (op_3 obj_03 obj_19)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_19)
   goals met: 1 of 2
10. (op_4 obj_19 obj_23)
   deleted: (pred_1 obj_23 obj_19) (pred_8)
   added: (pred_5 obj_23)
   goals met: 1 of 2
11. (op_3 obj_19 obj_03)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_03)
   goals met: 1 of 2
12. (op_1 obj_03 obj_23)
   deleted: (pred_5 obj_23)
   added: (pred_8) (pred_1 obj_23 obj_03)
   goals met: 2 of 2
